package com.signals;

import java.util.List;

public class SignalProcessing {
    private final static String seq = "777754311202722013475377431011521600476223605176161766617304712233677173150334525253172157612535362075660142541170066756374026364510045547151567335222723304141360726150141170740245300312646526007353406272337671006731550234277452161047161240365454461251362726747301505345073270327061677142677427273763265663664106264155433463524117537165466234233741445461346174135265542151612714423473";
    public static void decode8PSK_3000(List<Character> sig, String mode){
       //TODO LIST
        while (notEndOfSig){
            int startData = SequenceFinder.findSequence(sig, seq);
            sig = cutData(startData);
            //добавь тесты mock
            //2) вырезаю блок данных
            //3) дескремблирую.
            //4) убираю уолши  в 0-1 цифры
            //5)сформированы блоки размером 24 строки, 4 столбца (запись по строкам считывание по столбцам).
        }

    }

}
